## :x: terraform/cloudflare/b0xp.io/prometheus-operator:  tfmigrate plan

[Build link](https://github.com/boxp/arch/actions/runs/13699226304)

```
$ tfmigrate plan --out tfplan.binary
```

<details>


```
time="2025-03-06T12:59:41Z" level=info msg="download and unarchive the package" aqua_version=2.45.0 env=linux/amd64 exe_name=tfmigrate package_name=minamijoyo/tfmigrate package_version=v0.3.18 program=aqua registry=standard
2025/03/06 12:59:42 [INFO] AWS Auth provider used: "EnvProvider"
2025/03/06 12:59:42 [INFO] [runner] unapplied migration files: [20240320112233_migrate_tunnel.hcl 20240320112244_migrate_access.hcl 20240320112255_migrate_dns.hcl]
2025/03/06 12:59:42 [INFO] [runner] load migration file: tfmigrate/20240320112233_migrate_tunnel.hcl
2025/03/06 12:59:42 [INFO] [migrator] start state migrator plan
2025/03/06 12:59:42 [INFO] [migrator@.] terraform version: 1.6.2
2025/03/06 12:59:42 [INFO] [migrator@.] initialize work dir
2025/03/06 12:59:46 [INFO] [migrator@.] get the current remote state
2025/03/06 12:59:48 [INFO] [migrator@.] override backend to local
2025/03/06 12:59:48 [INFO] [executor@.] create an override file
2025/03/06 12:59:48 [INFO] [migrator@.] creating local workspace folder in: terraform.tfstate.d/default
2025/03/06 12:59:48 [INFO] [executor@.] switch backend to local
2025/03/06 12:59:50 [INFO] [migrator@.] compute a new state
2025/03/06 13:00:00 [INFO] [migrator@.] check diffs
2025/03/06 13:00:07 [INFO] [executor@.] remove the override file
2025/03/06 13:00:07 [INFO] [executor@.] remove the workspace state folder
2025/03/06 13:00:07 [INFO] [executor@.] switch back to remote
failed to run command (exited 1): terraform plan -state=/tmp/tmp2860537400 -input=false -no-color -detailed-exitcode -out=tfplan.binary
stdout:
data.aws_ssm_parameter.prometheus_operator_tunnel_secret: Reading...
aws_ssm_parameter.prometheus_operator_tunnel_token: Refreshing state... [id=prometheus-operator-tunnel-token]
data.aws_ssm_parameter.prometheus_operator_tunnel_secret: Read complete after 1s [id=prometheus-operator-tunnel-secret]
cloudflare_zero_trust_tunnel_cloudflared.prometheus_operator_tunnel: Refreshing state... [id=25190a02-f54f-4951-ac18-c98db4501fb4]
cloudflare_zero_trust_tunnel_cloudflared_config.prometheus_operator_tunnel: Refreshing state... [id=25190a02-f54f-4951-ac18-c98db4501fb4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # cloudflare_dns_record.grafana will be created
  + resource "cloudflare_dns_record" "grafana" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "grafana"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_dns_record.prometheus_web will be created
  + resource "cloudflare_dns_record" "prometheus_web" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "prometheus-web"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_zero_trust_access_application.grafana will be created
  + resource "cloudflare_zero_trust_access_application" "grafana" {
      + account_id                   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + cors_headers                 = (known after apply)
      + created_at                   = (known after apply)
      + destinations                 = (known after apply)
      + domain                       = "grafana.b0xp.io"
      + enable_binding_cookie        = false
      + footer_links                 = (known after apply)
      + http_only_cookie_attribute   = true
      + id                           = (known after apply)
      + landing_page_design          = (known after apply)
      + name                         = "Access application for grafana.b0xp.io"
      + path_cookie_attribute        = false
      + policies                     = [
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = (known after apply)
              + include          = (known after apply)
              + precedence       = 0
              + require          = (known after apply)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + target_criteria              = (known after apply)
      + updated_at                   = (known after apply)
    }

  # cloudflare_zero_trust_access_application.prometheus_web will be created
  + resource "cloudflare_zero_trust_access_application" "prometheus_web" {
      + account_id                   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + cors_headers                 = (known after apply)
      + created_at                   = (known after apply)
      + destinations                 = (known after apply)
      + domain                       = "prometheus-web.b0xp.io"
      + enable_binding_cookie        = false
      + footer_links                 = (known after apply)
      + http_only_cookie_attribute   = true
      + id                           = (known after apply)
      + landing_page_design          = (known after apply)
      + name                         = "Access application for prometheus-web.b0xp.io"
      + path_cookie_attribute        = false
      + policies                     = [
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = (known after apply)
              + include          = (known after apply)
              + precedence       = 0
              + require          = (known after apply)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + target_criteria              = (known after apply)
      + updated_at                   = (known after apply)
    }

  # cloudflare_zero_trust_access_policy.grafana_policy will be created
  + resource "cloudflare_zero_trust_access_policy" "grafana_policy" {
      + account_id                     = "1984a4314b3e75f3bedce97c7a8e0c81"
      + app_count                      = (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      + created_at                     = (known after apply)
      + decision                       = "allow"
      + exclude                        = (known after apply)
      + id                             = (known after apply)
      + include                        = [
          + {
              + login_method = {
                  + id = "b9248b7d-c1fa-48ab-8a43-ebffe03fabac"
                }
            },
        ]
      + isolation_required             = false
      + name                           = "policy for grafana.b0xp.io"
      + purpose_justification_required = false
      + require                        = (known after apply)
      + reusable                       = (known after apply)
      + session_duration               = "24h"
      + updated_at                     = (known after apply)
    }

  # cloudflare_zero_trust_access_policy.prometheus_web_policy will be created
  + resource "cloudflare_zero_trust_access_policy" "prometheus_web_policy" {
      + account_id                     = "1984a4314b3e75f3bedce97c7a8e0c81"
      + app_count                      = (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      + created_at                     = (known after apply)
      + decision                       = "allow"
      + exclude                        = (known after apply)
      + id                             = (known after apply)
      + include                        = [
          + {
              + login_method = {
                  + id = "b9248b7d-c1fa-48ab-8a43-ebffe03fabac"
                }
            },
        ]
      + isolation_required             = false
      + name                           = "policy for prometheus-web.b0xp.io"
      + purpose_justification_required = false
      + require                        = (known after apply)
      + reusable                       = (known after apply)
      + session_duration               = "24h"
      + updated_at                     = (known after apply)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.prometheus_operator_tunnel must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared" "prometheus_operator_tunnel" {
      ~ account_tag       = "1984a4314b3e75f3bedce97c7a8e0c81" -> (known after apply)
      + config_src        = "local" # forces replacement
      ~ connections       = [
          - {
              - client_id            = "b69b5e17-79d3-4ec3-a1f2-ec23ce762357" -> null
              - client_version       = "2025.1.0" -> null
              - colo_name            = "nrt07" -> null
              - id                   = "5668c332-99d3-40ec-9849-6b2c6f471e13" -> null
              - is_pending_reconnect = false -> null
              - opened_at            = "2025-02-27T12:54:39Z" -> null
              - origin_ip            = "126.99.243.55" -> null
              - uuid                 = "5668c332-99d3-40ec-9849-6b2c6f471e13" -> null
            },
          - {
              - client_id            = "b69b5e17-79d3-4ec3-a1f2-ec23ce762357" -> null
              - client_version       = "2025.1.0" -> null
              - colo_name            = "nrt01" -> null
              - id                   = "dfcd9eb3-56a1-4aae-95e1-d2b2749b0abd" -> null
              - is_pending_reconnect = false -> null
              - opened_at            = "2025-02-27T12:54:40Z" -> null
              - origin_ip            = "126.99.243.55" -> null
              - uuid                 = "dfcd9eb3-56a1-4aae-95e1-d2b2749b0abd" -> null
            },
          - {
              - client_id            = "b69b5e17-79d3-4ec3-a1f2-ec23ce762357" -> null
              - client_version       = "2025.1.0" -> null
              - colo_name            = "nrt05" -> null
              - id                   = "ba62a794-c182-41f0-82c0-3b270a51f75e" -> null
              - is_pending_reconnect = false -> null
              - opened_at            = "2025-02-27T12:54:41Z" -> null
              - origin_ip            = "126.99.243.55" -> null
              - uuid                 = "ba62a794-c182-41f0-82c0-3b270a51f75e" -> null
            },
          - {
              - client_id            = "b69b5e17-79d3-4ec3-a1f2-ec23ce762357" -> null
              - client_version       = "2025.1.0" -> null
              - colo_name            = "nrt08" -> null
              - id                   = "e61d47a2-e01f-461b-8e93-e07b2cc1bd16" -> null
              - is_pending_reconnect = false -> null
              - opened_at            = "2025-02-27T12:54:42Z" -> null
              - origin_ip            = "126.99.243.55" -> null
              - uuid                 = "e61d47a2-e01f-461b-8e93-e07b2cc1bd16" -> null
            },
        ] -> (known after apply)
      ~ conns_active_at   = "2025-02-27T12:54:39Z" -> (known after apply)
      + conns_inactive_at = (known after apply)
      ~ created_at        = "2024-04-17T14:07:53Z" -> (known after apply)
      + deleted_at        = (known after apply)
      ~ id                = "25190a02-f54f-4951-ac18-c98db4501fb4" -> (known after apply)
      ~ metadata          = jsonencode({}) -> (known after apply)
        name              = "cloudflare prometheus-operator tunnel"
      ~ remote_config     = true -> (known after apply)
      ~ status            = "healthy" -> (known after apply)
      ~ tun_type          = "cfd_tunnel" -> (known after apply)
      + tunnel_secret     = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.prometheus_operator_tunnel must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "prometheus_operator_tunnel" {
      ~ config     = {
          ~ ingress        = [
              ~ {
                  + origin_request = (known after apply)
                  + path           = ""
                    # (2 unchanged attributes hidden)
                },
              ~ {
                  + origin_request = (known after apply)
                  + path           = ""
                    # (2 unchanged attributes hidden)
                },
              ~ {
                  + origin_request = (known after apply)
                  + path           = ""
                    # (1 unchanged attribute hidden)
                },
            ]
          ~ origin_request = {
              + access                   = (known after apply)
              + ca_pool                  = (known after apply)
              + connect_timeout          = (known after apply)
              + disable_chunked_encoding = (known after apply)
              + http2_origin             = (known after apply)
              + http_host_header         = (known after apply)
              + keep_alive_connections   = (known after apply)
              + keep_alive_timeout       = (known after apply)
              + no_happy_eyeballs        = (known after apply)
              + no_tls_verify            = (known after apply)
              + origin_server_name       = (known after apply)
              + proxy_type               = (known after apply)
              + tcp_keep_alive           = (known after apply)
              + tls_timeout              = (known after apply)
            } -> (known after apply)
          ~ warp_routing   = {
              ~ enabled = false -> (known after apply)
            } -> (known after apply)
        }
      ~ created_at = "2025-01-04T09:33:37Z" -> (known after apply)
      ~ id         = "25190a02-f54f-4951-ac18-c98db4501fb4" # forces replacement -> (known after apply) # forces replacement
      ~ source     = "cloudflare" -> "local"
      ~ tunnel_id  = "25190a02-f54f-4951-ac18-c98db4501fb4" # forces replacement -> (known after apply) # forces replacement
      ~ version    = 10 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 0 to change, 2 to destroy.

Warning: Missing resource schema from provider

No resource schema found for cloudflare_access_application when decoding
prior state

Warning: Missing resource schema from provider

No resource schema found for cloudflare_access_application when decoding
prior state

Warning: Missing resource schema from provider

No resource schema found for cloudflare_access_policy when decoding prior
state

Warning: Missing resource schema from provider

No resource schema found for cloudflare_access_policy when decoding prior
state

Warning: Missing resource schema from provider

No resource schema found for cloudflare_record when decoding prior state

Warning: Missing resource schema from provider

No resource schema found for cloudflare_record when decoding prior state

stderr:

Error: no schema available for cloudflare_access_policy.prometheus_web_policy while reading state; this is a bug in Terraform and should be reported


Error: no schema available for cloudflare_record.grafana while reading state; this is a bug in Terraform and should be reported


Error: no schema available for cloudflare_access_policy.grafana_policy while reading state; this is a bug in Terraform and should be reported


Error: no schema available for cloudflare_record.prometheus_web while reading state; this is a bug in Terraform and should be reported


Error: no schema available for cloudflare_access_application.prometheus_web while reading state; this is a bug in Terraform and should be reported


Error: no schema available for cloudflare_access_application.grafana while reading state; this is a bug in Terraform and should be reported



```


</details>

<!-- github-comment: {"JobName":"plan","SHA1":"f29bbd69132c055ca38fd0d798218619a68921e5","TemplateKey":"tfmigrate-plan","Vars":{},"WorkflowName":"pull_request_target"} -->